#ifndef __DRIVER_DELAY_H
#define __DRIVER_DELAY_H

#include "config.h"

/************************************************************
* @brief 延时驱动初始化
* @param 无
* @return 无
************************************************************/
void DrvDelayInit(void);


/************************************************************
* @brief 微秒级延时函数
* @param us 延时时间，单位us
* @return 无
************************************************************/
void Delay_us(uint32_t us);


/************************************************************
* @brief 毫秒级延时函数
* @param ms 延时时间，单位ms
* @return 无
************************************************************/
void Delay_ms(uint32_t ms);


#endif /* __DRIVER_DELAY_H */
